{"html":"<p>Sulla Piattaforma Interoperabilità, è possibile fare due tipi diversi di client assertion. La prima prevede lo stacco di un token da spendere direttamente sull&#39;API machine-to-machine della piattaforma (InteropM2M), utile per fare operazioni sulla Piattaforma Interoperabilità senza passare dalla UI. La seconda permette di staccare un token firmato dalla Piattaforma Interoperabilità che sarà spendibile sull&#39;E-Service dell&#39;ente erogatore presso il quale, in qualità di fruitore, avete una richiesta di fruizione attiva. In principio sono simili, ma hanno alcune differenze, che vediamo nel dettaglio.</p>\n<h2 id=\"sommario\">Sommario</h2>\n<ul>\n<li><a href=\"#cos%C3%A8-una-client-assertion\">Cos&#39;è una client assertion?</a></li>\n<li><a href=\"#come-generare-la-client-assertion-per-ottenere-un-token-usabile-su-interopm2m\">Come generare la client assertion per ottenere un token usabile su InteropM2M?</a></li>\n<li><a href=\"#come-generare-la-client-assertion-per-ottenere-un-token-usabile-su-un-e-service\">Come generare la client assertion per ottenere un token usabile su un E-Service?</a></li>\n<li>FAQ<ul>\n<li><a href=\"#perche-non-posso-usare-la-stessa-chiave-per-un-client-verso-lerogatore-e-un-client-interopm2m\">Perché non posso usare la stessa chiave per un client verso l&#39;erogatore e un client InteropM2M?</a></li>\n</ul>\n</li>\n</ul>\n<h2 id=\"cosè-una-client-assertion\">Cos&#39;è una client assertion?</h2>\n<p>È un tipo di client credential del flusso OAuth. Per la specifica si rimanda all&#39;<a href=\"https://datatracker.ietf.org/doc/html/rfc7521\">RFC</a>. È un meccanismo attraverso il quale riesco ad autenticarmi presso un server autorizzativo per ottenere un token da spendere presso il possessore di una risorsa che mi interessa, che richiede autorizzazione per l&#39;accesso.</p>\n<h2 id=\"come-generare-la-client-assertion-per-ottenere-un-token-usabile-su-interopm2m\">Come generare la client assertion per ottenere un token usabile su InteropM2M?</h2>\n<p>Le informazioni di seguito denominate come &quot;kid&quot;, &quot;clientId&quot; e &quot;audience&quot; sono reperibili sulla Piattaforma Interoperabilità per lo specifico client e chiave che si stanno usando.</p>\n<p>L&#39;header prevede tre campi: &quot;kid&quot;, &quot;alg&quot; e &quot;typ&quot;:</p>\n<ul>\n<li>kid: l&#39;id della chiave. La chiave può essere scelta tra quelle disponibili nel pool di chiavi per un determinato client, che verrà usato nel payload come cliendId</li>\n<li>alg: l&#39;algoritmo utilizzato per firmare questo JWT (come JWS). In questo momento il valore è sempre &quot;RS256&quot;</li>\n<li>typ: il tipo di oggetto che sto inviando, sempre &quot;JWT&quot;</li>\n</ul>\n<p>Il payload prevede sei campi: &quot;iss&quot;, &quot;sub&quot;, &quot;aud&quot;, &quot;jti&quot;, &quot;iat&quot; e &quot;exp&quot;:</p>\n<ul>\n<li>iss: l&#39;issuer, in questo caso il clientId</li>\n<li>sub: il subject, in questo caso sempre il clientId</li>\n<li>aud: l&#39;audience, disponibile sulla Piattaforma Interoperabilità</li>\n<li>jti: il JWT ID, un id unico (uuid) random assegnato da chi vuole creare il token, serve per tracciare il token stesso. Deve essere cura del chiamante assicurarsi che l&#39;id di questo token sia unico</li>\n<li>iat: l&#39;issued at, il timestamp riportante data e ora in cui viene creato il token, espresso in <a href=\"https://datatracker.ietf.org/doc/html/rfc3339\">UNIX epoch</a> (valore numerico, non stringa)</li>\n<li>exp: l&#39;expiration, il timestamp riportante data e ora di scadenza del token, espresso in <a href=\"https://datatracker.ietf.org/doc/html/rfc3339\">UNIX epoch</a> (valore numerico, non stringa)</li>\n</ul>\n<p>Un volta ottenuto il token firmato dalla Piattaforma Interoperabilità, questo sarà spendibile presso l&#39;API machine-to-machine della Piattaforma stessa. Il token dovrà essere inserito come &quot;Bearer&quot; nell&#39;header &quot;Authorization&quot;.</p>\n<h2 id=\"come-generare-la-client-assertion-per-ottenere-un-token-usabile-su-un-e-service\">Come generare la client assertion per ottenere un token usabile su un E-Service?</h2>\n<p>La client assertion per staccare un token da spendere presso l&#39;E-Service di un ente erogatore deve contenere gli stessi campi indicati per la client assertion InteropM2M, con una differenza nel payload:</p>\n<ul>\n<li>purposeId: un campo in più che identifica la finalità per la quale si sta facendo la richiesta, reperibile sulla Piattaforma Interoperabilità</li>\n</ul>\n<p>Una volta ottenuto un token firmato dalla Piattaforma Interoperabilità, questo sarà spendibile sull&#39;E-Service dell&#39;erogatore secondo i termini e le audience stabilite nella descrizione dell&#39;E-Service stesso, nella richiesta di fruizione, e nella finalità indicata dal fruitore.</p>\n<h2 id=\"faq\">FAQ</h2>\n<h3 id=\"perché-non-posso-usare-la-stessa-chiave-per-un-client-verso-lerogatore-e-un-client-interopm2m\">Perché non posso usare la stessa chiave per un client verso l&#39;erogatore e un client InteropM2M?</h3>\n<p>ABC</p>\n"}