{"html":"<h2 id=\"sommario\">Sommario</h2>\n<ul>\n<li>Glossario<ul>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#e-service\">E-Service</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#attributo\">Attributo</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#richiesta-di-fruizione\">Richiesta di fruizione</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#chiave-pubblica\">Chiave pubblica</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#finalit%C3%A0\">Finalità</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#client\">Client</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#operatori-di-sicurezza\">Operatori di sicurezza</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#operatori-api\">Operatori API</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#amministratori-e-delegati\">Amministratori e delegati</a></li>\n</ul>\n</li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#introduzione-alla-piattaforma\">Introduzione alla piattaforma</a><ul>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#flusso-dellerogatore\">Flusso dell&#39;erogatore</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#flusso-del-fruitore\">Flusso del fruitore</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#operativit%C3%A0-e-sospensioni\">Operatività e sospensioni</a></li>\n</ul>\n</li>\n<li>E-service<ul>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#creare-un-nuovo-e-service\">Creare un nuovo E-Service</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#come-funzionano-gli-attributi\">Come funzionano gli attributi?</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#creare-una-nuova-versione-di-e-service\">Creare una nuova versione di E-Service</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#pubblicare-una-versione-di-e-service\">Pubblicare una versione di E-Service</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#archiviare-una-versione-di-e-service\">Archiviare una versione di E-Service</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#cancellare-una-bozza-di-e-service\">Cancellare una bozza di E-Service</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#sospendere-o-riattivare-una-versione-di-e-service\">Sospendere o riattivare una versione di E-Service</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#clonare-un-e-service\">Clonare un E-Service</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#gestire-il-carico-delle-service\">Gestire il carico dell&#39;E-Service</a></li>\n</ul>\n</li>\n<li>Richieste di fruizione<ul>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#fruitore-sottoscrivere-una-richiesta-di-fruizione\">Fruitore: sottoscrivere una richiesta di fruizione</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#erogatore-approvare-una-richiesta-di-fruizione\">Erogatore: approvare una richiesta di fruizione</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#aggiornare-una-richiesta-di-fruizione\">Aggiornare una richiesta di fruizione</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#sospendere-o-riattivare-una-richiesta-di-fruizione\">Sospendere o riattivare una richiesta di fruizione</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#archiviare-una-richiesta-di-fruizione\">Archiviare una richiesta di fruizione</a></li>\n</ul>\n</li>\n<li>Finalità<ul>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#creare-una-finalit%C3%A0\">Creare una finalità</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#associare-e-rimuovere-i-client-da-una-finalit%C3%A0\">Associare e rimuovere i client da una finalità</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#aggiornare-la-stima-di-carico-di-una-finalit%C3%A0\">Aggiornare la stima di carico di una finalità</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#sospendere-una-finalit%C3%A0\">Sospendere una finalità</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#archiviare-una-finalit%C3%A0\">Archiviare una finalità</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#eliminare-una-finalit%C3%A0\">Eliminare una finalità</a></li>\n</ul>\n</li>\n<li>Client e chiavi pubbliche<ul>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#creare-un-client\">Creare un client</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#eliminare-un-client\">Eliminare un client</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#gestire-gli-operatori-di-un-client\">Gestire gli operatori di un client</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#caricare-una-chiave-pubblica\">Caricare una chiave pubblica</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#eliminare-una-chiave-pubblica\">Eliminare una chiave pubblica</a></li>\n</ul>\n</li>\n<li>API Machine to machine<ul>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#a-cosa-servono-le-api-m2m\">A cosa servono le API M2M?</a></li>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#come-utilizzare-le-api-m2m\">Come utilizzare le API M2M</a></li>\n</ul>\n</li>\n<li>FAQ<ul>\n<li><a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#mi-mancano-alcune-voci-di-men%C3%B9-cosa-succede\">Mi mancano alcune voci di menù, cosa succede?</a></li>\n</ul>\n</li>\n</ul>\n<h2 id=\"glossario\">Glossario</h2>\n<h3 id=\"e-service\">E-Service</h3>\n<p>È la descrizione di un servizio digitale accedibile tramite un&#39;API. L&#39;E-Service è reso disponibile da un aderente erogatore che ne permette la fruizione agli aderenti fruitori in possesso di una richiesta di fruizione attiva. L&#39;API pubblicata sulla Piattaforma dall&#39;ente erogatore dovrà rispettare i criteri e gli standard stabiliti dalla Piattaforma Interoperabilità.</p>\n<p>L&#39;interazione tra il Fruitore e l&#39;Erogatore, la richiesta di servizi e lo scambio di eventuali dati, avviene al di fuori della Piattaforma di Interoperabilità. La Piattaforma si fa garante e registra la legittimità delle richieste sulla base di quanto dichiarato da erogatore e fruitore. La Piattaforma reistra inoltre l&#39;atto della sottoscrizione e della successiva attivazione della richiesta di fruizione.</p>\n<h3 id=\"attributo\">Attributo</h3>\n<p>Un attributo è una qualità che un aderente possiede o dichiara di possedere. L&#39;aderente erogatore, all&#39;atto della creazione di un E-Service, stabilisce quali sono gli attributi che l&#39;aderente fruitore dovrà possedere per poter vedere accettata la sua richiesta di fruizione. Per maggiori informazioni sugli attributi, vedi <a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#come-funzionano-gli-attributi\">la sezione dedicata</a>.</p>\n<h3 id=\"richiesta-di-fruizione\">Richiesta di fruizione</h3>\n<p>L&#39;aderente fruitore interessato a fruire di un E-Service disponibile sul catalogo degli E-Service può presentare una richiesta di fruizione. Per poterlo fare, deve possedere alcuni attributi di default e dichiarare o dimostrare di possederne altri, sulla base di quanto richiesto dall&#39;ente che eroga l&#39;E-Service. Per permettere questa verifica, la richiesta di fruizione non viene attivata automaticamente all&#39;atto della sottoscrizione, ma è soggetta a valutazione da parte dell&#39;ente erogatore.</p>\n<h3 id=\"chiave-pubblica\">Chiave pubblica</h3>\n<p>L&#39;autorizzazione all&#39;accesso all&#39;API dell&#39;erogatore da parte del fruitore avviene attraverso un meccanismo di client assertion. Il fruitore deposita una chiave pubblica sulla Piattaforma Interoperabilità secondo il meccanismo del client, descritto più sotto, tenendo per sé la chiave privata. La chiave pubblica sarà usata dalla Piattaforma Interoperabilità per generare un token che il fruitore potrà spendere presso l&#39;erogatore, che ne verificherà l&#39;autenticità, il livello di autorizzazione e la validità.</p>\n<h3 id=\"finalità\">Finalità</h3>\n<p>È una dichiarazione che l&#39;aderente fruitore presenta per dettagliare il suo accesso all&#39;E-Service dell&#39;ente erogatore presso il quale ha una richiesta di fruizione attiva. Per ogni E-Service, è possibile presentare un numero indefinito di finalità. Ogni finalità raccoglierà l&#39;analisi del rischio relativa alla natura dei dati utilizzati, e una &quot;stima di carico&quot; che dichiara qual è lo sforzo richiesto all&#39;infrastruttura dell&#39;ente erogatore (il numero di chiamate API al giorno stimate).</p>\n<p>Le finalità vengono attivate mano a mano che sono presentate dal fruitore all&#39;erogatore, automaticamente, fino al raggiungimento della soglia massima imposta dall&#39;erogatore. Quando, sommando tutte le finalità che un aderente fruitore dichiara su un determinato E-Service, si eccede il carico che l&#39;erogatore ha dichiarato di poter sostenere, le nuove finalità non saranno più attivate automaticamente. Da quel punto in poi, l&#39;erogatore avrà facoltà di attivare manualmente le nuove finalità, dichiarando una data di attivazione, in modo da avere il tempo di adeguare l&#39;infrastruttura a reggere il carico.</p>\n<h3 id=\"client\">Client</h3>\n<p>Di fatto, un gruppo di operatori di sicurezza autorizzati a caricare chiavi pubbliche. Ogni client raccoglierà un gruppo di operatori di sicurezza e un gruppo di chiavi. La composizione del client potrà essere gestita a piacimento degli amministratori dell&#39;ente fruitore, che potranno associare lo stesso operatore di sicurezza a uno o più client. Ogni client (e quindi, di fatto, ogni gruppo di chiavi) può essere associato a una o più finalità.</p>\n<h3 id=\"operatori-di-sicurezza\">Operatori di sicurezza</h3>\n<p>Un operatore di sicurezza è un&#39;utenza tecnica dedicata a un ente in modalità fruizione. Può solo vedere i client ai quali è associato. Per questi client, può caricare ed eliminare chiavi pubbliche.</p>\n<h3 id=\"operatori-api\">Operatori API</h3>\n<p>Un operatore API è un&#39;utenza tecnica dedicata a un ente in modalità erogazione. Può gestire il ciclo di vita degli E-Service per conto di amministratori e delegati.</p>\n<h3 id=\"amministratori-e-delegati\">Amministratori e delegati</h3>\n<p>Sono utenze amministrative. Oltre ai permessi degli operatori, hanno la possibilità di gestire tutti gli atti di tipo amministrativo e di gestire tutte le utenze presenti negli enti dei quali sono amministratori o delegati. L&#39;unica differenza tra le due utenze è che l&#39;amministratore coincide con il rappresentante legale dell&#39;ente.</p>\n<h2 id=\"introduzione-alla-piattaforma\">Introduzione alla Piattaforma</h2>\n<p>La Piattaforma è divisa in due modalità: erogazione e fruzione. Se la tua utenza ha privilegi da &quot;amministratore&quot;, le vedrai entrambe nel menù di sinistra. Ogni aderente della Pubblica Amministrazione può essere contemporaneamente erogatore di alcuni E-Service e fruitore di altri. La Piattaforma fornisce una UI per gestire tutte le operazioni di creazione, modifica, aggiornamento e archiviazione del ciclo di vita degli E-Service sia per gli erogatori che per i fruitori. Allo stesso tempo, fornisce una API machine to machine per automare molte delle operazioni disponibili da UI.</p>\n<p>NB: l&#39;interazione machine to machine tra erogatore e fruitore avviene al di fuori della Piattaforma Interoperabilità. La Piattaforma ha il ruolo di garante tra i due enti in base alle dichiarazione rese e conservate all&#39;interno della Piattaforma stessa.</p>\n<h3 id=\"flusso-dellerogatore\">Flusso dell&#39;erogatore</h3>\n<p>L&#39;ente che intende erogare un E-Service potrà crearlo e gestirlo dalla voce di menù &quot;Erogazione &gt; I miei E-Service&quot;. Una volta pubblicato un E-Service, sarà reso disponibile sul catalogo degli E-Service, visualizzabile in modalità fruizione (&quot;Fruizione &gt; Catalogo E-Service&quot;). Gli enti interessati a fruire dell&#39;E-Service, e in possesso dei requisiti minimi richiesti dall&#39;erogatore, potranno iscriversi presentando una richiesta di fruizione. Ogni ente erogatore troverà le richieste di fruizione presentate dai fruitori in &quot;Erogazione &gt; Richieste di fruizione&quot;, dove potrà gestirle. Quando una richiesta viene approvata, l&#39;aderente fruitore potrà presentare delle finalità e iniziare a utilizzare l&#39;E-Service messo a disposizione dall&#39;erogatore.</p>\n<h3 id=\"flusso-del-fruitore\">Flusso del fruitore</h3>\n<p>L&#39;aderente che intende fruire di un E-Service potrà visualizzare tutti quelli disponibili andando su &quot;Fruizione &gt; Catalogo E-Service&quot;. Se possiede i requisiti minimi per usufruirne, visualizzerà un pulsante &quot;Iscriviti&quot;, attraverso il quale potrà presentare una richiesta di fruizione che l&#39;ente erogatore valuterà. Una volta che la richiesta di fruizione è approvata e attiva, l&#39;aderente fruitore potrà creare delle finalità. In ogni finalità, dovrà indicare il dettaglio sull&#39;accesso e l&#39;utilizzo dei dati e la stima della quantità di richieste che insisteranno sull&#39;ente erogatore (numero di chiamate API nell&#39;unità di tempo). Ad ogni finalità potrà associare uno o più client. Le chiavi contenute in quei client potranno essere utilizzate per contattare l&#39;ente erogatore dell&#39;E-Service a cui la finalità è associata, secondo il meccanismo della client assertion.</p>\n<h3 id=\"operatività-e-sospensioni\">Operatività e sospensioni</h3>\n<p>Per garantire la possibilità di un pronto intervento da parte degli enti erogatori e fruitori rispetto a malfunzionamenti ed eventuali usi malevoli, la Piattaforma Interoperabilità mette a disposizione la possibilità di sospendere il servizio in diversi punti del flusso. Un fruitore può verificare se la propria finalità può accedere all&#39;E-Service al quale è associata andando sotto &quot;Fruizione &gt; Le tue finalità&quot;, selezionare la finalità di interesse, cliccare &quot;Ispeziona&quot; e verificare alla voce &quot;Questa finalità può accedere all’E-Service dell’erogatore?&quot; lo stato di operatività della finalità.</p>\n<p>A scopo esemplificativo, osservare il seguente grafico:</p>\n<p><img src=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/assets/interop-chart.svg\" alt=\"Grafico del flusso piattaforma interoperabilità\"></p>\n<p>Esistono tre punti nei quali è possibile limitare l&#39;operatività del servizio:</p>\n<ol>\n<li>in caso di emergenza, l&#39;erogatore può unilateralmente sospendere una versione di E-Service, di fatto impedendo l&#39;accesso a tutte le richieste di fruizione ed alle finalità ad esse associate;</li>\n<li>inoltre, sia l&#39;erogatore che il fruitore possono sospendere unilateralmente una richiesta di fruizione, di fatto impedendo l&#39;accesso a tutte le finalità ad essa associate;</li>\n<li>infine, il fruitore può sospendere unilateralmente una finalità.</li>\n</ol>\n<p>Ogni atto di sospensione di fatto prevederà che tutte le chiavi contenute nei client associati alla finalità non saranno temporaneamente utilizzabili per generare token nel flusso di client assertion, di fatto interrompendo l&#39;accesso all&#39;E-Service fornito dall&#39;erogatore fino a quando non viene riattivato il flusso nel punto in cui era stato sospeso.</p>\n<p>È possibile un ultimo caso: il fruitore ha facoltà di gestire i propri operatori di sicurezza, aggiungendoli, sospendendoli, riattivandoli o rimuovendoli. Le operazioni sugli operatori di sicurezza non hanno impatti immediati sulle chiavi. Per saperne di più, vedere <a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#gestire-gli-operatori-di-un-client\">la sezione dedicata</a>.</p>\n<h2 id=\"e-service-1\">E-service</h2>\n<h3 id=\"creare-un-nuovo-e-service\">Creare un nuovo E-Service</h3>\n<p>Se sei un amministratore, delegato, o operatore API, troverai la voce di menù &quot;Erogazione &gt; I tuoi E-Service&quot;. Da lì, clicca su &quot;+ Aggiungi&quot;. Segui la procedura guidata, inserendo le informazioni indicate. Potrai interrompere il processo in qualsiasi momento. Ad ogni step è possibile salvare i dati in bozza e riprendere la compilazione in un successivo momento. È importante sapere che, una volta pubblicata la versione 1 di un E-Service, non è più possibile modificare le informazioni generali (nome e descrizione dell&#39;E-Service, tecnologia utilizzata e attributi richiesti per sottoscrivere una richiesta di fruizione). Sarà sempre possibile creare una nuova versione di E-Service mano a mano che l&#39;API evolve.</p>\n<h3 id=\"come-funzionano-gli-attributi\">Come funzionano gli attributi?</h3>\n<p>Nel primo step di creazione di un E-Service, viene richiesto all&#39;ente erogatore di definire gli attributi che saranno richiesti all&#39;ente fruitore per sottoscrivere una richiesta di fruizione. Questi attributi possono essere di tre tipi: certificati, dichiarati e verificati.</p>\n<p>Gli attributi certificati vengono attributi automaticamente all&#39;ente in base alle informazioni presenti nei database delle fonti autoritative a disposizione della Piattaforma Interoperabilità. La verifica del possesso di questi attributi da parte dell&#39;ente fruitore viene effettuata automaticamente dalla Piattaforma Interoperabilità.</p>\n<p>Per gli attributi dichiarati, l&#39;ente fruitore, all&#39;atto della sottoscrizione di una richiesta di fruizione, dichiarerà implicitamente di possederli. La veridicità di questa dichiarazione è al solo carico del fruitore, e non necessita di verifica da parte dell&#39;ente erogatore.</p>\n<p>Gli attributi verificati sono attributi &quot;riutilizzabili&quot; sulla Piattaforma. In sostanza, sono attributi dei quali un altro ente erogatore ha già verificato il possesso per lo stesso fruitore. L&#39;ente erogatore può decidere, all&#39;atto della creazione dell&#39;E-Service, se intende avvalersi della verifica fatta da un altro erogatore (nel qual caso non dovrà verificare a sua volta il possesso degli attributi verificati da parte dell&#39;ente fruitore), oppure può decidere di effettuare una nuova verifica. In caso di nuova verifica, l&#39;ente fruitore sarà tenuto a presentare la documentazione sulla base della quale l&#39;ente erogatore verificherà il possesso degli attributi verificati da parte dell&#39;ente fruitore.</p>\n<p>Gli attributi possono essere organizzati singolarmente o in &quot;gruppi&quot;. Se viene creato un gruppo di attributi, sarà sufficiente all&#39;ente erogatore possedere uno tra quelli elencati per ritenere quel gruppo valido. A scopo esemplificativo, se un E-Service richiede un gruppo di attributi certificati che include &quot;Comune&quot; e &quot;Regione&quot;, ogni ente che abbia come attributo certificato quello di &quot;Comune&quot; oppure quello di &quot;Regione&quot; soddisferà il requisito.</p>\n<h3 id=\"creare-una-nuova-versione-di-e-service\">Creare una nuova versione di E-Service</h3>\n<p>Gli E-Service funzionano con un sistema di versionamento. Una volta pubblicata la prima versione, è sempre possibile crearne di nuove, che sono numerate automaticamente in ordine crescente. Per creare una nuova versione, nella vista &quot;Erogazione &gt; I tuoi E-Service&quot; si può cliccare sui tre pallini alla voce dell&#39;E-Service di interesse, e selezionare &quot;Crea bozza nuova versione&quot;. Se l&#39;azione non è disponibile dall&#39;elenco per un E-Service in stato &quot;attivo&quot; o &quot;sospeso&quot;, vuol dire che quell&#39;E-Service ha già una versione in bozza e non è possibile avere più bozze contemporaneamente.</p>\n<h3 id=\"pubblicare-una-versione-di-e-service\">Pubblicare una versione di E-Service</h3>\n<p>Un E-Service in stato di bozza può essere pubblicato immediatamente al termine della procedura guidata di creazione della versione. In alternativa, se una versione di E-Service è in bozza e tutti i campi sono stati compilati correttamente, si potrà pubblicare dalla pagina &quot;Erogazione &gt; I tuoi E-Service&quot;. Cliccando sui tre pallini della versione di E-Service in bozza, è possibile selezionare &quot;Pubblica&quot;. Se la pubblicazione fallisce, significa che uno o più campi richiesti non sono stati compilati.</p>\n<p>Una volta pubblicata una bozza, questa diventerà la nuova versione &quot;attiva&quot; dell&#39;E-Service, mandando la versione precedente in stato &quot;deprecato&quot;. Le versioni deprecate continueranno a funzionare, ma forniranno un&#39;indicazione utile agli enti fruitori, in modo che possano aggiornare i loro sistemi all&#39;ultima versione.</p>\n<h3 id=\"archiviare-una-versione-di-e-service\">Archiviare una versione di E-Service</h3>\n<p>Quando tutte le richieste di fruizione presenti su una versione di E-Service sono state aggiornate ad una versione più recente, sarà possibile archiviare una versione di E-Service. Quest&#39;azione è irreversibile. Da quel momento in poi, quella versione di E-Service può essere dismessa. Se una versione di E-Service è archiviabile, sarà possibile farlo andando su &quot;Erogazione &gt; I tuoi E-Service&quot;, cliccare sui tre pallini della versione di E-Service deprecata che ci interessa, e cliccare su &quot;Archivia&quot;. Se il pulsante non è disponibile, vuol dire che quella versione di E-Service non è ancora archiviabile.</p>\n<h3 id=\"cancellare-una-bozza-di-e-service\">Cancellare una bozza di E-Service</h3>\n<p>Se un E-Service è alla prima versione e non è ancora stata pubblicata, è possibile cancellare interamente l&#39;E-Service. Se invece esiste una versione già pubblicata, non è possibile cancellare l&#39;E-Service per intero. Sarà sempre possibile, però cancellare le versioni succesive dell&#39;E-Service in stato di bozza. Per farlo, andare su &quot;Erogazione &gt; I tuoi E-Service&quot;, cliccare sui tre pallini della versione di E-Service in bozza desiderata, e cliccare su &quot;Elimina&quot;. Se l&#39;azione non è disponibile, vuol dire che quella versione di E-Service non è più in bozza e non è dunque eliminabile.</p>\n<h3 id=\"sospendere-o-riattivare-una-versione-di-e-service\">Sospendere o riattivare una versione di E-Service</h3>\n<p>L&#39;ente erogatore può unilateralmente decidere di sospendere o riattivare una versione di E-Service. Per sospenderla, l&#39;E-Service deve essere in stato &quot;attivo&quot; o &quot;deprecato&quot;. Per riattivarla, deve essere in stato &quot;sospeso&quot;. Attenzione: la sospensione di una versione di E-Service comporta che tutti gli enti fruitori non potranno più accedere all&#39;E-Service fino a quando non sarà riattivato.</p>\n<h3 id=\"clonare-un-e-service\">Clonare un E-Service</h3>\n<p>Per facilitare la procedura di creazione di E-Service molto simili, è possibile usare una funzionalità di clonazione. Per farlo, andare su un &quot;Erogazione &gt; I tuoi E-Service&quot;, cliccare sui tre pallini dell&#39;E-Service da clonare e selezionare &quot;Clona&quot;. È possibile clonare solo versioni di E-Service in stato &quot;attivo&quot; o &quot;deprecato&quot;. L&#39;E-Service creato da questo clone sarà messo in stato di bozza e la sua numerazione di versione partirà dalla 1, indipendentemente dal numero di versione dell&#39;E-Service dal quale è stato clonato.</p>\n<h3 id=\"gestire-il-carico-delle-service\">Gestire il carico dell&#39;E-Service</h3>\n<p>Quanto un ente erogatore crea una nuova versione di E-Service, viene richiesto di indicare la soglia di chiamate API al giorno permesse all&#39;ente fruitore. L&#39;ente fruitore che ha una richiesta di fruizione attiva per questa versione di E-Service potrà continuare a dichiarare finalità fino al raggiungimento di questa soglia. Fino a quanto la somma di tutte le chiamate dichiarate nelle finalità del fruitore rimane sotto la soglia, le finalità verranno automaticamente approvate dalla Piattaforma Interoperabilità.</p>\n<p>La prima finalità che finisce sopra la soglia (e tutte le eventuali successive), verranno messe in uno stato di &quot;attesa di approvazione&quot;. L&#39;ente erogatore troverà queste finalità in attesa entrando all&#39;interno del singolo E-Service da &quot;Erogazione &gt; I tuoi E-Service&quot;, cliccando su &quot;Ispeziona&quot;. All&#39;interno della vista del singolo E-Service, sarà disponibile una tab &quot;Finalità da evadere&quot;. Al suo interno, sarà presente la lista delle finalità che attualmente superano la soglia impostata dall&#39;erogatore.</p>\n<p>L&#39;erogatore potrà attivare manualmente ognuna di quelle finalità, o definire una data di completamento attività che sarà comunicata all&#39;ente fruitore. La data di completamento è eventualmente modificabile unilateralmente dall&#39;erogatore.</p>\n<h2 id=\"richieste-di-fruizione\">Richieste di fruizione</h2>\n<h3 id=\"fruitore-sottoscrivere-una-richiesta-di-fruizione\">Fruitore: sottoscrivere una richiesta di fruizione</h3>\n<p>Per visualizzare tutti gli E-Service disponibili sulla Piattaforma, andare su &quot;Fruizione &gt; Catalogo E-Service&quot;. Per esplorare in dettaglio un E-Service, è possibile farlo cliccando sul pulsante &quot;Ispeziona&quot;.</p>\n<p>Se l&#39;ente erogatore possiede gli attributi certificati richiesti, l&#39;ente fruitore potrà presentare una richiesta di fruizione, cliccando su &quot;Iscriviti&quot;. All&#39;atto dell&#39;iscrizione, l&#39;ente fruitore implicitamente dichiarerà di possedere eventuali attributi dichiarati richiesti dall&#39;erogatore. Per quanto riguarda eventuali attributi verificati, se l&#39;ente erogatore ha richiesto una nuova verifica degli attributi verificati, sarà cura del fruitore presentare presso l&#39;erogatore la documentazione per poter procedere alla verifica stessa.</p>\n<p>All&#39;atto della presentazione di una richiesta di fruizione, questa non sarà approvata immediatamente. Sarà inviata all&#39;ente erogatore, che provvederà a effettuare eventuali verifiche sulle dichiarazioni e la documentazione resa dal fruitore sui suoi attributi, e quindi potrà attivare o rifiutare la richiesta di fruizione.</p>\n<p>L&#39;ente fruitore potrà nuovamente presentare richiesta se una richiesta di fruizione viene rifiutata, dopo aver aggiornato la propria documentazione dettagliando le mutate circostanze.</p>\n<p>Una volta che una richiesta di fruizione passa in stato &quot;attivo&quot;, l&#39;E-Service per la quale è stata approvata comparirà nell&#39;elenco di E-Service per i quali è possibile creare una o più finalità.</p>\n<p>È sempre possibile verificare lo stato delle richieste di fruizione sottoscritte andando su &quot;Fruizione &gt; Le tue richieste&quot;.</p>\n<h3 id=\"erogatore-approvare-una-richiesta-di-fruizione\">Erogatore: approvare una richiesta di fruizione</h3>\n<p>Quando un ente fruitore presenta una richiesta di fruizione presso un erogatore, questa compare nella vista &quot;Erogazione &gt; Richieste di fruizione&quot;. Se risultano in stato &quot;in attesa&quot;, significa che l&#39;erogatore non ha ancora completato i controlli per accettare o negare la richiesta di fruizione.</p>\n<p>Per poter accettare una richiesta di fruizione, è necessario che tutti gli attributi verificati che necessitano di nuova verifica siano attivati dall&#39;ente erogatore. Provare ad attivare una richiesta di fruizione senza aver verificato tutti gli attributi porterà ad un errore nell&#39;approvazione.</p>\n<h3 id=\"aggiornare-una-richiesta-di-fruizione\">Aggiornare una richiesta di fruizione</h3>\n<p>Ogni richiesta di fruizione è fortemente legata alla versione di E-Service per la quale è stata presentata. Se una richiesta di fruizione è stata presentata per un E-Service in versione 5, nel momento in cui quell&#39;E-Service viene aggiornato alla versione 6, la Piattaforma segnalerà che è possibile effettuare un aggiornamento.</p>\n<p>Nel momento in cui l&#39;ente fruitore, unilateralmente, decide di aggiornare la richiesta di fruizione alla versione più recente dell&#39;E-Service tutte le sue finalità saranno migrate, e da quel momento utilizzeranno la nuova versione. L&#39;operazione è irreversibile.</p>\n<p>Per aggiornare una richiesta di fruizione, andare su &quot;Fruizione &gt; Le mie richieste&quot;, cliccare sui tre pallini della richiesta di interesse e selezionare l&#39;azione &quot;Aggiorna&quot;.</p>\n<h3 id=\"sospendere-o-riattivare-una-richiesta-di-fruizione\">Sospendere o riattivare una richiesta di fruizione</h3>\n<p>È possibile sospendere o riattivare una richiesta di fruizione sia da parte dell&#39;ente erogatore che del fruitore. Ognuna delle due azioni è unilaterale. Se l&#39;ente erogatore sospende la richiesta di fruizione, l&#39;ente fruitore non potrà riattivarla, e viceversa. In sostanza, la richiesta di fruizione è attiva se sia per l&#39;erogatore che per il fruitore è attiva. Per sospendere o riattivare una richiesta di fruizione, l&#39;erogatore va su &quot;Erogazione &gt; Richieste di fruizione&quot;, il fruitore su &quot;Fruzione &gt; Le mie richieste&quot;. Entrambi possono cliccare sui tre pallini della richiesta di interesse e sospenderla o riattivarla. Se non compare l&#39;azione nell&#39;elenco, è perché non è possibile compierla in quel momento.</p>\n<h3 id=\"archiviare-una-richiesta-di-fruizione\">Archiviare una richiesta di fruizione</h3>\n<p>Non è attualmente possibile archiviare manualmente una richiesta di fruizione. L&#39;archiviazione è automatica nel momento in cui si effettua l&#39;aggiornamento della richiesta di fruizione. A scopo esemplificativo, se esiste una richiesta di fruizione attiva per la versione 5 di un E-Service, nel momento in cui esce una versione 6 e il fruitore effettua l&#39;aggiornamento, la richiesta di fruizione per la versione 6 diventa attiva mentre la 5 diventa archiviata.</p>\n<h2 id=\"finalità-1\">Finalità</h2>\n<h3 id=\"creare-una-finalità\">Creare una finalità</h3>\n<p>Un fruitore può creare una nuova finalità andando su &quot;Fruizione &gt; Le tue finalità&quot; e cliccando &quot;+ Aggiungi&quot;. Una finalità è composta essenzialmente di alcune informazioni generali, dalla stima legata all&#39;impiego delle risorse dell&#39;erogatore (numero di chiamate al giorno stimate), dall&#39;analisi del rischio rispetto all&#39;utilizzo dei dati, e dai client associati. Una volta pubblicata la finalità, le informazioni generali e l&#39;analisi del rischio non sono modificabili, mentre sarà possibile aggiornare i client utilizzati e la stima di carico.</p>\n<p>Nel momento in cui si crea la finalità, sarà necessario indicare l&#39;E-Service per il quale la finalità sarà attiva. Dall&#39;elenco, si potranno scegliere solo gli E-Service per i quali l&#39;ente ha una richiesta di fruizione attiva.</p>\n<p>Sarà sempre possibile se mantenere la finalità in bozza o pubblicarla. Una volta pubblicata, diventerà immediatamente attiva se l&#39;utilizzo delle risorse indicato è sotto la soglia stabilita dell&#39;erogatore. Andrà invece in approvazione presso l&#39;erogatore in caso contrario. Per maggiori informazioni sul meccanismo di stima del carico, <a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#gestire-il-carico-dellE-Service\">leggi qui</a>.</p>\n<h3 id=\"associare-e-rimuovere-i-client-da-una-finalità\">Associare e rimuovere i client da una finalità</h3>\n<p>È possibile associare i client ad una finalità sia all&#39;atto della creazione della finalità stessa che in un secondo momento. Se si intende modificare i client associati in un secondo momento, andare su &quot;Fruizione &gt; Le mie finalità&quot;, trovare la finalità desiderata e cliccare su &quot;Ispeziona&quot;. Nella tab &quot;Client associati&quot; sarà possibile aggiungere e rimuovere i client dalla finalità.</p>\n<p>Una volta rimosso un client da una finalità, non sarà più possibile utilizzare le chiavi contenute in quel client per contattare l&#39;erogatore dell&#39;E-Service per quella specifica finalità. A scopo esemplificativo, se lo stesso client è stato associato a due finalità che fanno riferimento allo stesso E-Service e viene rimosso da una sola delle due, continuerà a funzionare per l&#39;altra.</p>\n<h3 id=\"aggiornare-la-stima-di-carico-di-una-finalità\">Aggiornare la stima di carico di una finalità</h3>\n<p>Se la motivazione per accedere ad un E-Service rimane la stessa, ma cambiano le necessità in termini di richieste API necessarie, è possibile aggiornare la stima di carico (numero di chiamate API al giorno stimate) per quella finalità. Se il risultato dell&#39;aggiornamento è un valore sotto la soglia impostata dall&#39;ente erogatore, verrà aggiornata automaticamente. In caso contrario, la finalità continuerà a funzionare con la stima di carico antecedente all&#39;aggiornamento. L&#39;aggiornamento sarà a carico dell&#39;erogatore, che ha facoltà di decidere i tempi in base al carico della propria infrastruttura.</p>\n<p>Per aggiornare la stima di carico, andare su &quot;Fruizione &gt; Le mie finalità&quot;, cliccare sui tre pallini della finalità di interesse e selezionare l&#39;azione &quot;Aggiorna stima di carico&quot;. Inserire la nuova stima di carico nella modale che viene aperta.</p>\n<h3 id=\"sospendere-una-finalità\">Sospendere una finalità</h3>\n<p>In qualsiasi momento il fruitore può unilateralmente sospendere una propria finalità. Il risultato sarà che le chiavi pubbliche in uso per quella finalità non permetteranno più di staccare un token per il contatto machine to machine. Inoltre, verrà alleggerito il carico stimato sull&#39;E-Service dell&#39;erogatore. Quel carico potrà essere usato per eventuali altre finalità sullo stesso E-Service.</p>\n<p>Per sospendere una finalità, andare su &quot;Fruizione &gt; Le mie finalità&quot;, cliccare sui tre pallini della finalità di interesse e selezionare l&#39;azione &quot;Sospendi&quot;.</p>\n<h3 id=\"archiviare-una-finalità\">Archiviare una finalità</h3>\n<p>Se non sussiste più la necessità di accedere ad un E-Service per una specifica finalità, è possibile archiviarla. Quest&#39;azione è irreversibile, tuttavia sarà sempre possibile creare nuove finalità, anche in tutto e per tutto uguali a quelle archiviate. Il risultato dell&#39;archiviazione sarà che viene alleggerito il carico stimato sull&#39;erogatore, e che quindi il fruitore potrà sfruttare quel carico per eventuali altre finalità sullo stesso E-Service. L&#39;archiviazione di una finalità fa sì che le chiavi che erano state depositate sui client associati a quella finalità non funzionino più per la finalità stessa. Continueranno comunque a funzionare per tutte le altre finalità alle quali sono associati.</p>\n<p>Per archiviare una finalità, andare su &quot;Fruizione &gt; Le mie finalità&quot;, cliccare sui tre pallini della finalità di interesse e selezionare l&#39;azione &quot;Archivia&quot;.</p>\n<h3 id=\"eliminare-una-finalità\">Eliminare una finalità</h3>\n<p>È possibile eliminare una finalità solamente quando questa è in bozza. Per eliminare una finalità in bozza, andare su &quot;Fruizione &gt; Le mie finalità&quot;, cliccare sui tre pallini della finalità di interesse e selezionare l&#39;azione &quot;Elimina&quot;.</p>\n<h2 id=\"client-e-chiavi-pubbliche\">Client e chiavi pubbliche</h2>\n<h3 id=\"creare-un-client\">Creare un client</h3>\n<p>I client servono per facilitare l&#39;organizzazione e il raggruppamento del personale tecnico e delle chiavi pubbliche che questi sono autorizzati a caricare. È possibile creare client in modalità fruizione dalla voce di menù &quot;Fruizione &gt; Gestione client&quot;, e poi &quot;+ Aggiungi&quot;. Il contenuto del client è modificabile in qualsiasi momento, inclusa l&#39;aggiunta e la rimozione dei suoi operatori di sicurezza. La creazione del client di per sé non ha effetto sull&#39;accesso agli E-Service. Deve essere successivamente aggiunto ad una o più finalità per le quali le chiavi saranno utilizzabili nel flusso di client assertion.</p>\n<h3 id=\"eliminare-un-client\">Eliminare un client</h3>\n<p>È possibile eliminare un client dalla vista &quot;Fruizione &gt; Gestione client&quot;, cliccare sui tre pallini e selezionare l&#39;azione &quot;Elimina&quot;. Attenzione: l&#39;eliminazione in toto di un client prevede anche la sua rimozione da tutte le finalità alle quali è eventualmente associato, e prevede l&#39;eliminazione di tutte le chiavi associate a quel client, che non potranno più essere utilizzate nel ciclo di creazione di token validi spendibili presso gli E-Service degli enti erogatori. Se si vuole agire su una singola finalità, vedere <a href=\"https://uat.gateway.test.pdnd-interop.pagopa.it/ui/it/aiuto#associare-e-rimuovere-i-client-da-una-finalit%C3%A0\">la sezione relativa</a>.</p>\n<h3 id=\"gestire-gli-operatori-di-un-client\">Gestire gli operatori di un client</h3>\n<p>In qualsiasi momento, è possibile aggiungere o rimuovere operatori di sicurezza da uno specifico client. Gli operatori aggiunti avranno la possibilità di caricare chiavi pubbliche da utilizzare nel ciclo di client assertion. Gli operatori rimossi non potranno più operare all&#39;interno di quello specifico client, anche se le chiavi caricate fino a quel momento rimarrano valide e attive e potranno essere rimosse da altri utenti che hanno ancora accesso al client. Questo flusso è pensato per facilitare la continuità di servizio nell&#39;eventualità di un ricambio di personale. Per gestire gli operatori di un client, andare su &quot;Fruizione &gt; Gestisci client&quot;, trovare la riga della tabella dedicata al client di interesse e cliccare su &quot;Ispeziona&quot;. All&#39;interno del singolo client, selezionare la tab &quot;Operatori di sicurezza&quot;.</p>\n<p>In questa fase di sperimentazione, se l&#39;operatore di sicurezza da associare al client non è presente tra le utenze in elenco, sarà necessario segnalarlo al team della Piattaforma Interoperabilità che provvederà a crearlo e ad associarlo all&#39;ente.</p>\n<h3 id=\"caricare-una-chiave-pubblica\">Caricare una chiave pubblica</h3>\n<p>Quando un&#39;operatore di sicurezza effettua l&#39;accesso alla Piattaforma Interoperabilità, troverà i client ai quali è associato sotto &quot;Fruizione &gt; Gestione client&quot;. Entrando all&#39;interno del client di interesse, può andare nella tab &quot;Chiavi pubbliche&quot; e &quot;+ Aggiungi&quot; per caricare una nuova chiave. Contestualmente, sono disponibili delle istruzioni per facilitare la creazione di nuove chiavi. Le chiavi caricate saranno immediatamente utilizzabili, se il client a cui appartengono è associato ad almeno una finalità il cui flusso di interazione con l&#39;erogatore è attivo.</p>\n<h3 id=\"eliminare-una-chiave-pubblica\">Eliminare una chiave pubblica</h3>\n<p>Per eliminare una chiave pubblica da un client, un operatore di sicurezza può andare su &quot;Fruizione &gt; Gestisci client&quot; e cliccare su &quot;Ispeziona&quot; per il client di interesse. All&#39;interno, nella tab &quot;Chiavi pubbliche&quot; sarà disponibile l&#39;elenco delle chiavi caricate per quel client. Cliccando sui tre pallini della chiave di interesse, è disponibile l&#39;azione &quot;Elimina&quot;, che eliminerà la chiave. L&#39;eliminazione di una chiave preveda che questa non possa più essere usata per generare token nel giro di client assertion.</p>\n<h2 id=\"api-machine-to-machine\">API Machine to machine</h2>\n<h3 id=\"a-cosa-servono-le-api-m2m\">A cosa servono le API M2M?</h3>\n<p>Se si desidera implementare delle automazioni oppure eseguire azioni in bulk, è disponibile una API che implementa molte delle funzionalità disponibili sulla Piattaforma Interoperabilità, chiamata &quot;Interop M2M&quot;. L&#39;unica parte del flusso che non è esposta attraverso API è la gestione delle chiavi, per la quale si richiede agli utenti di lavorare attraverso interfaccia web.</p>\n<h3 id=\"come-utilizzare-le-api-m2m\">Come utilizzare le API M2M</h3>\n<p>Per utilizzare le API, si può andare sotto &quot;Fruizione &gt; Interop M2M&quot;. È necessario aggiungere almeno un client con un operatore di sicurezza, che a sua volta carichi almeno una chiave. Le chiavi depositate nei client Interop potranno essere usate esclusivamente per l&#39;utilizzo con l&#39;API Interop M2M.</p>\n<h2 id=\"faq\">FAQ</h2>\n<h3 id=\"mi-mancano-alcune-voci-di-menù-cosa-succede\">Mi mancano alcune voci di menù, cosa succede?</h3>\n<p>Se hai permessi da operatore (di sicurezza o API) è normale, alcune sezioni della Piattaforma richiedono privilegi da amministratore o delegato.</p>\n"}