[
  {
    "type": "h2",
    "text": "Meccanismi di sospensione"
  },
  {
    "type": "h3",
    "text": "Sei erogatore dell'e-service?"
  },
  {
    "type": "h4",
    "text": "Sospensione di una versione di un e-service"
  },
  {
    "type": "p",
    "text": "Tutti gli enti fruitori che hanno stipulato accordi di interoperabilità per questa versione dell'e-service non potranno più staccare il token per accedere a questo e-service; use case: c'è un data breach ed è necessario interrompere l'erogazione di un servizio; secondo use case: la versione viene sospesa perché è deprecata da più di 90 giorni, in modo da incoraggiare i fruitori a migrare a una versione più recente. Una volta che tutti gli accordi saranno aggiornati, sarà possibile archiviare quella versione dell’e-service"
  },
  {
    "type": "h4",
    "text": "Sospensione di un accordo di interoperabilità"
  },
  {
    "type": "p",
    "text": "Viene sospeso l'accordo di interoperabilità per il solo ente fruitore sottoscrittore di quell'accordo. L'e-service rimarrà disponibile a tutti gli altri fruitori che hanno sottoscritto un accordo di interoperabilità; use case: c'è il sospetto che un fruitore sia oggetto di un data breach, e viene sospeso il suo accesso all'e-service"
  },
  {
    "type": "h4",
    "text": "Sospensione di un operatore API"
  },
  {
    "type": "p",
    "text": "L'operatore API non potrà più fare accesso alla piattaforma come parte dell'ente che l'ha sospeso; use case: la persona fisica si dimette o viene licenziata, non deve più poter operare per conto dell'ente"
  },

  {
    "type": "h3",
    "text": "Sei fruitore dell'e-service?"
  },
  {
    "type": "h4",
    "text": "Sospensione di un accordo di interoperabilità"
  },
  {
    "type": "p",
    "text": "Viene sospeso l'accesso a tutti i client associati all'e-service per il quale l'accordo è stato sottoscritto; use case: c'è il sospetto che un erogatore sia oggetto di un data breach, e viene sospeso l'accesso all'e-service"
  },
  {
    "type": "h4",
    "text": "Sospensione di un client"
  },
  {
    "type": "p",
    "text": "Viene sospeso solamente quel client, mentre tutti gli altri associati a un determinato e-service per cui c'è un accordo di interoperabilità attivo potranno continuare ad accedere regolarmente. La sospensione del client non comporta la sospensione degli operatori di sicurezza ad esso legato, che potranno continuare ad accedere alla piattaforma. Le loro chiavi, se attive, non saranno comunque sufficienti a garantire accesso all'e-service se il client o l'accordo sono sospesi; use case: un accordo di fornitura con un fornitore esterno scade; si sospende il client per negare loro accesso una volta scaduti i termini"
  },
  {
    "type": "h4",
    "text": "Sospensione di un operatore di sicurezza legato a un client"
  },
  {
    "type": "p",
    "text": "L'operatore non potrà più fare accesso alla piattaforma come parte del client che l'ha sospeso. La chiave associata a quell'operatore per quel client rimane attiva; use case: la persona fisica si dimette o viene licenziata, non deve più poter operare per conto dell'ente. In caso si voglia cancellare la chiave, una persona con i permessi da amministratore per l'ente potrà in ogni momento cancellare le chiavi di tutti gli operatori"
  },

  {
    "type": "h2",
    "text": "Test h2"
  },
  {
    "type": "p",
    "text": "L'operatore non potrà più fare accesso alla piattaforma come parte del client che l'ha sospeso. La chiave associata a quell'operatore per quel client rimane attiva; use case: la persona fisica si dimette o viene licenziata, non deve più poter operare per conto dell'ente. In caso si voglia cancellare la chiave, una persona con i permessi da amministratore per l'ente potrà in ogni momento cancellare le chiavi di tutti gli operatori"
  },
  {
    "type": "h3",
    "text": "Test h3"
  },
  {
    "type": "p",
    "text": "L'operatore non potrà più fare accesso alla piattaforma come parte del client che l'ha sospeso. La chiave associata a quell'operatore per quel client rimane attiva; use case: la persona fisica si dimette o viene licenziata, non deve più poter operare per conto dell'ente. In caso si voglia cancellare la chiave, una persona con i permessi da amministratore per l'ente potrà in ogni momento cancellare le chiavi di tutti gli operatori"
  },
  {
    "type": "h4",
    "text": "Test h4"
  },
  {
    "type": "p",
    "text": "L'operatore non potrà più fare accesso alla piattaforma come parte del client che l'ha sospeso. La chiave associata a quell'operatore per quel client rimane attiva; use case: la persona fisica si dimette o viene licenziata, non deve più poter operare per conto dell'ente. In caso si voglia cancellare la chiave, una persona con i permessi da amministratore per l'ente potrà in ogni momento cancellare le chiavi di tutti gli operatori"
  }
]
